{
  "basics": {
    "name": "Mehdi Hasan",
    "label": "Mobile Application Developer",
    "picture": "profilePhoto.jpg",
    "email": "email2mehdihasan@gmail.com",
    "phone": "+8801751290833",
    "skype": "live:email2mehdihasan",
    "website": "https://www.linkedin.com/in/md-mehdi-hasan/",
    "summary": "Passionate software developer with 8+ years of experience driving quality and consistency throughout all phases of software development projects. A partner who leads collaborative efforts with analysts, QA and support engineers throughout a product lifecycle to produce high-quality, user-friendly, scalable and bug-free software. I credit my success to the fundamental belief that business needs must be fully understood and remain paramount throughout a project. Compounded by my core belief in Agile methodologies and extensive experience using a broad range of technologies, I’m able to document the most efficient architecture for a true end-to-end solution. Results remain unparalleled. Whether your team needs a reliable teammate or proved leader, I can help!",
    "location": {
      "address": "Bildstensvägen 4 F",
      "postalCode": "226 54",
      "city": "Lund",
      "countryCode": "SE",
      "region": "Sweden"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "md-mehdi-hasan",
        "url": "https://www.linkedin.com/in/"
      },
      {
        "network": "Github",
        "username": "mehdihasan",
        "url": "https://github.com/"
      }
    ]
  },
  "work": [
    {
      "company": "Hungrig",
      "position": "Mobile Application Developer",
      "website": "https://hungrig.se/",
      "startDate": "02/18/2019",
      "endDate": "",
      "summary": "HUNGRIG.se is a service for both people and companies that wants to order good quality restaurant food, home delivered to their doorstep. From Malmö in the south to Luleå in the North, with over 1200 restaurants connected",
      "highlights": [
      ]
    },
    {
      "company": "Cefalo",
      "position": "Senior Software Engineer",
      "website": "https://www.cefalo.com/",
      "startDate": "05/01/2016",
      "endDate": "01/15/2019",
      "summary": "In Cefalo, I have directly worked with DN (Dagens Næringsliv), which is Norway's 3rd largest newspaper specialising in business news, owned by NHST Media Group.",
      "highlights": [
        "Started this project with an e-paper app with stable numbers of unique users in Q1 2016, to a full phase native media app in Android and iOS platform developed with continues releases. By the end of 2018 the app has 6 times as many unique users as it had at project start and it is still growing.",
        "Solo responsible person to architect, develop & deploy the DN Android app which has 10,000+ install in the GPS. Planned use of OOP, Executors, AsyncTask, Dagger, VIPER pattern etc made the app loading faster, modularize and robust.",
        "Contributed different modules in the DN iOS App using swift.",
        "Beside the native mobile applications, I have also worked on content API & Gateway applications in a microservice architectural environment using Spring Boot framework.",
        "Writing Unit Test codes for Android platforms and Spring Boot.",
        "TECH: Java, Kotlin, Swift, Android SDK, iOS SDK, Spring, Spring Boot, React Native, MySQL, OpenShift, Jenkins, Adobe SDK, Comscore, GDPR, JIRA etc."
      ]
    },
    {
      "company": "Syndao",
      "position": "Software Engineering Consultant",
      "website": "https://syndaoapps.com/",
      "startDate": "12/01/2015",
      "endDate": "",
      "summary": "SYNDAO (TM) is an Applications Solutions company from USA. Currently focused on the Healthcare Industry and the Emergency Management sector. We have three products currently: medCNX (TM), emsCNX (TM) and CodeRED (TM). I have been involved with the entire SDLC process for all the current products.",
      "highlights": [
        "Most of the softwares developed by Syndao has two parts: backend (communication between apps and managing admin stuffs) and user interaction part (PWA and native mobile apps). I am working both of the parts. Performing devOps role as well.",
        "TECH: Android SDK, iOS SDK, PHP, Javascript, HTML, CSS, Java, MySQL, PWA, AWS, Firebase, Google Analytics, Android Jetpack Architecture, HIPPA, Safari and Chrome Push Notification, ServiceWorker, Cron, Integration of SSO etc."
      ]
    },
    {
      "company": "iGlyphic",
      "position": "Software Consultant",
      "website": "http://iglyphic.com/",
      "startDate": "05/01/2015",
      "endDate": "",
      "summary": "As a startup, iGlyphic focuses on developing small-scale software products which meet the needs of hospitals, stores, fashion houses & different types of non-government organizations.",
      "highlights": [
        "Negotiated with clients, Lead the team, participate in the development process through the entire SDLC process to billing and delivered 7 successful projects to the clients",
        "Lead a team of freelance developers from scratch to publish:",
        "- 14 ThemeForest products (HTML and Wordpress Themes) ",
        "- 8 CodeCanyon products (Android and iOS Applications)",
        "- 5 Google Play Store products (Android Applications) "
      ]
    },
    {
      "company": "AAPBD",
      "position": "Project Manager",
      "website": "http://www.aapbd.com/",
      "startDate": "02/01/2016",
      "endDate": "04/01/2016",
      "summary": "Advanced Apps Bangladesh Limited (AAPBD) is a digital enterprise specialized in mobile and web app development.",
      "highlights": [
        "Introduce GIT instead of SVN as VCS and trained the team to adopt it.",
        "Managed five different teams & 7 different projects (Android, IOS, Web & API, Design & QA) of total 21+ people",
        "Delivered 3 completed projects to clients within 2 months of joining",
        "Undertaking and devising mobile application developer recruitment process.",
        "Introduced quarterly in-house training sessions",
        "Projects: Mahash, Zamen, sloppy, love-lane, d-liv, NPS, ywaper"
      ]
    },
    {
      "company": "W3 Engineers",
      "position": "Sr. Software Engineer Team Lead",
      "website": "http://w3engineers.com/",
      "startDate": "12/01/2012",
      "endDate": "01/01/2016",
      "summary": "W3Engineers is an interactive web application development and consulting firm that utilizes latest technology, creative design and optimized business strategy to help businesses build their brand. ",
      "highlights": [
        "Lead the deployment process for every production release on Google Play Store and App Store.",
        "Manage JIRA for issue tracking, distribution of task, sprint management.",
        "Liaison between the product team from Canada and development team in Bangladesh.",
        "Regular code reviews for the development team.",
        "Providing technical direction for development",
        "Developed backend authentication system and friend matching application using Python Tornado framework, DynamoDB and Twillo.",
        "Developed TCP and UDP socket communication module for YO! Android Application & iOS Application",
        "Developed Authentication, contact sync and friend search and find module for YO! Android Application & iOS Application",
        "Developed the entire Christmas.com iOS application from scratch to deploy to the App Store (by learning Objective-C and iOS SDK by my own) ",
        "Developed Teetimes.net iOS application firstly at Cordova framework and then on native iOS framework",
        "Part of the development team to develop and publishing Christmas.com Android application",
        "Worked on Teetimes.net Android application's search module, navigation module, geo-location module and the UI"
      ]
    },
    {
      "company": "IIML",
      "position": "System Engineer",
      "website": "http://capturedata.com/",
      "startDate": "02/01/2011",
      "endDate": "02/01/2012",
      "summary": "IIMI helps organizations of all types and sizes transform their data into information and knowledge, driving insight and action. I was responsible to provide system / networking service to more than 3500+ data entry operators and software engineers",
      "highlights": []
    },
    {
      "company": "Aamra Networks",
      "position": "Network Engineer",
      "website": "https://www.aamranetworks.com/",
      "startDate": "09/01/2010",
      "endDate": "01/01/2011",
      "summary": "Aamra networks limited is one of the leader of communication solutions industry in Bangladesh.",
      "highlights": [
        "End user Gateway Server/Router/Switch/Polycom installation and troubleshooting.",
        "Provide solution to customers remotely."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "East West University",
      "area": "",
      "studyType": "B.Sc in Information and Communication Engineering",
      "startDate": "08/01/2006",
      "endDate": "2010",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Front End Development",
      "level": "Master",
      "keywords": [
        "Android SDK",
        "iOS SDK",
        "Java",
        "Kotlin",
        "Swift",
        "Objective-C",
        "Flutter",
        "Dart",
        "Python",
        "SQL",
        "PHP",
        "HTML",
        "CSS",
        "Javascript",
        "jQuery",
        "React Native",
        "Spring Boot",
        "Tornado",
        "Yii",
        "Progressive Web App",
        "AWS",
        "Git",
        "CI/CD",
        "Agile Methodologies",
        "Scrum",
        "Mobile Application Development",
        "Web Applications",
        "Web Development",
        "Design Patterns",
        "VIPER",
        "MVP",
        "MVC",
        "SDLC",
        "Jira"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Travel",
      "keywords": []
    }
  ],
  "references": []
}
