{
  "basics": {
    "name": "Mehdi Hasan",
    "label": "Software Engineer",
    "picture": "profile.png",
    "email": "mail@mehdihasan.me",
    "phone": "‭+46 73-495 36 52‬",
    "skype": "skype.mehdi",
    "resume": "https://www.dropbox.com/s/w85g5044zldvncc/resume-mehdi-2020-01-21.pdf?dl=0",
    "website": "https://www.linkedin.com/in/md-mehdi-hasan/",
    "summary": "Experienced and driven software professional with over a decade of expertise driving quality and consistency throughout the entire software development lifecycle. I excel in leading cross-functional teams, encompassing analysts, QA specialists, support engineers, and stakeholders, across all phases of software development, from requirement analysis to architectural design, development, deployment, maintenance, monitoring, and troubleshooting.",
    "location": {
      "address": "Bildstensvägen 4 F",
      "postalCode": "226 54",
      "city": "Lund",
      "countryCode": "SE",
      "region": "Sweden"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "md-mehdi-hasan",
        "url": "https://www.linkedin.com/in/"
      },
      {
        "network": "Github",
        "username": "mehdihasan",
        "url": "https://github.com/"
      },
      {
        "network": "Gitlab",
        "username": "hasanmehdi",
        "url": "https://gitlab.com/"
      }
    ]
  },
  "work": [
    {
      "company": "Axis Communications AB",
      "position": "Experienced Software Engineer",
      "website": "https://www.axis.com/",
      "startDate": "01/02/2023",
      "endDate": "",
      "location": "Lund, Skane County, Sweden",
      "jobType": "Full-time",
      "summary": "Industry leader in video surveillance.",
      "highlights": [
        "TECH: Data Engineering, Linux, Embedded Systems, Redis, GitOps, Microservices, Kubernetes, Python (Programming Language), Elasticsearch, Kibana, Prometheus.io, Grafana, Containerization, Design Patterns, Object-Oriented Programming (OOP), Software Development Life Cycle (SDLC), Software Design, Test Driven Development, SQL, Git, REST API, Jenkins, Docker, API Development, DevOps"
      ]
    },
    {
      "company": "HCL Sweden AB",
      "position": "Senior Technical Lead",
      "website": "https://www.hcltech.com/geo-presence/sweden",
      "startDate": "03/31/2020",
      "endDate": "12/26/2022",
      "location": "Helsingborg, Skane County, Sweden",
      "jobType": "Full-time",
      "summary": "HCL Technologies is a next-generation global technology company that helps enterprises reimagine their businesses for the digital age. Through its worldwide network of R&D facilities and co-innovation labs, global delivery capabilities, and over 150,000+ ‘Ideapreneurs’ across 49 countries, HCL delivers holistic services across industry verticals to leading enterprises, including 250 of the Fortune 500 and 650 of the Global 2000.",
      "highlights": [
        "### INGKA Group / IKEA IT AB",
        "As part of my journey in HCL, I am working for INGKA group which brought the IKEA Brand to 30 countries and millions of homes.",
        "Working in an enterprise environment with microservices, event-driven systems, data integration pipelines between systems and applications, monitoring the data integrations and tracing the events",
        "Design, development, implementation and maintenance of high throughput, high volume, resilient data integration pipelines, and components between Kafka (Connect Connect), GCP, Oracle, Event Mesh (Solace), and API applications.",
        "Development and maintenance of highly scalable, resource-efficient, flexible, resilient, fault-tolerant Kafka plugins - Connectors, Single Message Transforms and Kafka Streams applications.",
        "Developed micro-services in SpringBoot, Flask frameworks using Java, Kotlin and Python.",
        "Implemented Kafka mirror makers between different Kafka clusters across different data-centers.",
        "Automation of frequent operational activities using Ansible.",
        "Implemented KSQL and developed message processing applications based on KSQL.",
        "Developed Jenkins CICD scripts to automate build and deployment jobs uisng Bash scripting and Groovy.",
        "TECH: Java, Kotlin, Spring, Spring Cloud, Strimzi Kafka, Strimzi Bridge, Kafka, Kafka Connect, Kafka Transforms, Kafka SMT, Kafka Connector, Kafka Converters, Schema Registry, KSQL, AVRO, JSON, XML, XSLT, Openshift, Kubernetes, Helm, Docker, Ansible, Python, Flask, GCP, Google Cloud Pub-Sub, Cloud Run, GKE, Solace, Event Mesh, Oracle, PostgreSQL, Jenkins, Prometheus, Grafana, Splunk."
      ]
    },
    {
      "company": "Additude AB",
      "position": "Senior Information Technology Consultant",
      "website": "https://www.additude.se/",
      "startDate": "10/01/2019",
      "endDate": "03/30/2020",
      "location": "Malmo, Sweden",
      "jobType": "Full-time",
      "summary": "Work full time as senior information technology consultant.",
      "highlights": [
        "TECH: Android SDK, iOS SDK, Viper, MVP, MVVM, Android Jetpack Architecture, Fastlane, Jenkins, MsAppcenter, TDD, JUnit, Kubernetes, Docker, Espresso, React & Express, Accessibility, etc."
      ]
    },
    {
      "company": "RestaurangOnline Sverige AB",
      "position": "Mobile Application Developer",
      "website": "https://hungrig.se/",
      "startDate": "02/18/2019",
      "endDate": "09/30/2019",
      "location": "Lund, Sweden",
      "jobType": "Full-time",
      "summary": "Worked on HUNGRIG.se service which is a platform for both people and companies that wants to order good quality restaurant food, home delivered to their doorstep.",
      "highlights": [
        "Developing and distributing all the mobile applications developed for end users, restaurants and delivery managers in native iOS and Android Platform in Swift, Objective-C, Java and Kotlin.",
        "Implemented build, test & deploy automation for Client Hungrig app, Delivery manager and Restaurants apps for both iOS and Android (Unit test, Integration test and UI test) using JUnit, Mockito, Roboelectric, Espresso, XCTest, Accessibility, Fastlane & Jenkins.",
        "Implement automation of iOS push notification certificate (.pem & .p12) generation for 180+ apps through fastlane",
        "Implemented Android 64 bit and bundle app support for Android apps and iOS 13 support for iOS apps.",
        "TECH: Android SDK, iOS SDK, Viper, MVP, MVVM, Android Jetpack Architecture, Fastlane, Jenkins, MsAppcenter, TDD, JUnit, Mockito, Roboelectric, Espresso, XCTest, Accessibility, etc."
      ]
    },
    {
      "company": "Cefalo AS",
      "position": "Senior Software Engineer",
      "website": "https://www.cefalo.com/",
      "startDate": "05/01/2016",
      "endDate": "01/15/2019",
      "location": "Dhaka, Bangladesh | Oslo, Norway",
      "jobType": "Full-time",
      "summary": "In Cefalo, I have directly worked for DN (Dagens Næringsliv), which is Norway's 3rd largest newspaper specialising in business news, owned by NHST Media Group.",
      "highlights": [
        "### NHST Media Group / Dagens Næringsliv",
        "Started this project with an e-paper app with stable numbers of unique users in Q1 2016, to a full phase native media app in Android and iOS platform developed with continuous releases. By the end of 2018 the app has 6 times as many unique users as it had at project start and it is still growing.",
        "DN-App Legacy API Application: The purpose was to serve feeds to DN mobile applications. Core functionalities including  fetch content from different sources and process the HTML content to mobile friendly data structure and serve the payload, subscription based authorization system, Dashboard for editors to manipulate the front row of the mobile applications.",
        "DN-App Backend Gateway Application: 2nd version of the API application developed in Spring Boot as a Gateway Application in a microservice architecture. Improvement of performance by applying concurrency and modularization. Technology: Java, Maven, Spring, Spring-boot, MySQL, Thymeleaf, JSP, Openshift, Jenkins, Jsoup, Tomcat.",
        "Solo responsible person to architect, develop & deploy the DN Android app which has 10,000+ installed in the GPS. Planned use of OOP, Executors, AsyncTask, Dagger, VIPER pattern etc made the app loading faster, modularize and robust.",
        "Contributed different modules in the DN iOS App using swift.",
        "Writing Test codes for Android platforms and Spring Boot.",
        "TECH: Spring, Spring Boot, MySQL, OpenShift, Jenkins, Java, Kotlin, Swift, Android SDK, iOS SDK, Adobe SDK, Comscore, GDPR, JIRA etc."
      ]
    },
    {
      "company": "Syndao LLC",
      "position": "Software Engineering Consultant",
      "website": "https://syndaoapps.com/",
      "startDate": "12/01/2015",
      "endDate": "03/01/2019",
      "location": "Cincinnati, Ohio, USA (Remote)",
      "jobType": "Contract",
      "summary": "Syndao LLC is a startup from USA which is working to provide flawless communication means to its customers. I have been involved with the entire SDLC process of all the software developed by SyndaoApps.",
      "highlights": [
        "CodeRed: An application to emergency situation management system. I have developed the backend application using Spring Framework and Hibernate. Core functionality: Authentication using OAuth2 and JWT, Resource server, Role based authorization, messaging management between users using Firebase, sending notifications to the users on emergency situation etc.  Developed CI/CD pipeline using Jenkins to build, test and deploy the application to Tomcat. Tech: Java, Maven, Spring-boot, MySQL, Firebase, Tomcat, Jenkins, Cargo, Digital Ocean.",
        "medCNX: An application for Physician profile search / Disaster protocol content management system / Custom Google analytics integration in the dashboard using PHP Yii framework. Integrated SSO (by Azure AD) for authentication of the application users. Set up LAPM and Apache Virtual Hosts on AWS to deploy the application. Developed CRON to remote SFTP excel file access to regular update of the MySQL database.",
        "Cornerstone PTO software: A pay time off web portal for healthcare professionals. Developed the backend using PHP Yii Framework and MySQL and a very basic user interface using Javascript,  HTML & CSS.",
        "EMSConnect: The core functionality of the application was to search for the nearby 5 hospitals and providing the details to the mobile app. Developed the backend using PHP & MySQL.",
        "TECH: Spring, Hibernate, Java, Maven, Gradle, Android SDK, iOS SDK, PHP, Javascript, HTML, CSS, MySQL, PWA, AWS, Digital Ocean, Tomcat, LAMP, Firebase, Google Analytics, Android Jetpack Architecture, HIPPA, Safari and Chrome Push Notification, ServiceWorker, Cron, Integration of SSO etc."
      ]
    },
    {
      "company": "iGlyphic",
      "position": "Software Consultant",
      "website": "http://iglyphic.com/",
      "startDate": "05/01/2015",
      "endDate": "05/01/2019",
      "location": "Dhaka, Bangladesh",
      "jobType": "Self-employed",
      "summary": "As a startup, iGlyphic focuses on developing small-scale software products which meet the needs of hospitals, stores, fashion houses & different types of non-government organizations.",
      "highlights": [
        "Negotiated with clients, Lead the team, participate in the development process through the entire SDLC process to billing and delivered 7 successful projects to the clients",
        "Lead a team of freelance developers from scratch to publish:",
        "- 14 ThemeForest products (HTML and Wordpress Themes) ",
        "- 8 CodeCanyon products (Android and iOS Applications)",
        "- 5 Google Play Store products (Android Applications) "
      ]
    },
    {
      "company": "W3 Engineers",
      "position": "Sr. Software Engineer Team Lead",
      "website": "http://w3engineers.com/",
      "startDate": "12/01/2012",
      "endDate": "01/01/2016",
      "location": "Khulna, Bangladesh",
      "jobType": "Full-time",
      "summary": "W3Engineers is an interactive web application development and consulting firm that utilizes latest technology, creative design and optimized business strategy to help businesses build their brand. ",
      "highlights": [
        "Lead the deployment process for every production release on Google Play Store and App Store.",
        "Manage JIRA for issue tracking, distribution of task, sprint management.",
        "Liaison between the product team from Canada and development team in Bangladesh.",
        "Regular code reviews for the development team.",
        "Providing technical direction for development",
        "YO! Backend Application: As a communication application YO! requires authentication, verification and friend matching. To meet the need I have developed the backend application using Tornado (a Python asynchronous web framework which supports non-blocking network I/O, can scale concurrent 10,000 open connections, long live connections), HMAC, DynamoDB (AWS) and Twillo.",
        "Developed TCP and UDP socket communication module for YO! Android Application & iOS Application",
        "Developed Authentication, contact sync and friend search and find module for YO! Android Application & iOS Application",
        "Developed Teetimes.net iOS application firstly at Cordova framework and then on native iOS framework",
        "Worked on Teetimes.net Android application's search module, navigation module, geo-location module and the UI",
        "Teetimes API: Developed the API application to server feed to the mobile applications. Core functionality including searching for golf courses based on location, date-time and number of players. Also to book the course from the course provider. Technology: PHP Yii framework, MySQL.",
        "Answers.net Backend Purpose of the project was to develop a platform like answers.com. I have worked on the backend which was fetching data from Yahoo Answers API, process it in our backend and then saving it to a PostgreSQL database after serving the feed as JSON payload on request from the mobile app.Technology used: PHP Yii Framework, PostgreSQL, JSON, Yahoo Answers API. I have used Objective-C to develop the mobile application.",
        "Developed the Christmas.com iOS application from scratch to deploy to the App Store (by learning Objective-C and iOS SDK by my own) ",
        "Christmas.com API The purpose of the API application was to serve feed for Android and iOS applications. Functionalities including showing latest random paginated feeds for the home page, product details feed including comments, ratings, related products etc, user details feed, search API. Technology used: PHP, MySQL, JSON.",
        "Part of the development team to develop and publishing Christmas.com Android application"
      ]
    },
    {
      "company": "IIML",
      "position": "System Engineer",
      "website": "http://capturedata.com/",
      "startDate": "02/01/2011",
      "endDate": "02/01/2012",
      "location": "Dhaka, Bangladesh",
      "jobType": "Full-time",
      "summary": "IIMI helps organizations of all types and sizes transform their data into information and knowledge, driving insight and action. I was responsible to provide system / networking service to more than 3500+ data entry operators and software engineers",
      "highlights": []
    },
    {
      "company": "Aamra Networks",
      "position": "Network Engineer",
      "website": "https://www.aamranetworks.com/",
      "startDate": "09/01/2010",
      "endDate": "01/01/2011",
      "location": "Dhaka, Bangladesh",
      "jobType": "Full-time",
      "summary": "Aamra networks limited is one of the leader of communication solutions industry in Bangladesh.",
      "highlights": [
        "End user Gateway Server/Router/Switch/Polycom installation and troubleshooting.",
        "Provide solution to customers remotely."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "East West University",
      "area": "",
      "studyType": "B.Sc in Information and Communication Engineering",
      "startDate": "08/01/2006",
      "endDate": "2010",
      "gpa": "",
      "courses": []
    }
  ],
  "certification": [
    {
      "institution": "Google Cloud",
      "area": "A Professional Data Engineer enables data-driven decision making by collecting, transforming, and publishing data. A data engineer should be able to design, build, operationalize, secure, and monitor data processing systems with a particular emphasis on security and compliance; scalability and efficiency; reliability and fidelity; and flexibility and portability. A Data Engineer should also be able to leverage, deploy, and continuously train pre-existing machine learning models.",
      "studyType": "Google Cloud Certified Professional Data Engineer",
      "issueDate": "01/11/2022",
      "certificate": "https://www.credential.net/88ce16d0-110f-49de-b21e-127af88b4da8",
      "courses": []
    },
    {
      "institution": "Google Cloud",
      "studyType": "API Design and Fundamentals",
      "area": "A professional API designer performs API design using OpenAPI specifications to create well-structured APIs. This involves mastering the API life cycle, with the assistance of the Apigee API platform for comprehensive life cycle management. The process includes designing APIs through the utilization of API proxies. Furthermore, APIs are bundled into API products, which are then made available for utilization by application developers.",
      "issueDate": "14/09/2022",
      "certificate": "https://www.credential.net/88ce16d0-110f-49de-b21e-127af88b4da8",
      "courses": []
    },
    {
      "institution": "Google Cloud",
      "studyType": "Professional Cloud Architect",
      "area": "A Google Cloud Certified - Professional Cloud Architect enables organizations to leverage Google Cloud technologies. Through an understanding of cloud architecture and Google technology, this individual can design, develop, and manage robust, secure, scalable, highly available, and dynamic solutions to drive business objectives.",
      "issueDate": "01/12/2021",
      "certificate": "https://www.credential.net/88ce16d0-110f-49de-b21e-127af88b4da8",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Back End Development",
      "level": "Master",
      "keywords": [
        "API Applications",
        "AWS",
        "Agile Methodologies",
        "Ansible",
        "Android Jetpack",
        "Android SDK",
        "Apache",
        "AVRO",
        "Backend Applications",
        "CI/CD",
        "Cloud Native Application Development",
        "CSS",
        "Design Patterns",
        "Digital Ocean",
        "Docker",
        "Eclipse",
        "Espresso",
        "Event Mesh (Solace)",
        "Fastlane",
        "Flask",
        "Git",
        "Google Cloud Platform",
        "Google Cloud Pub-Sub",
        "Gradle",
        "Hibernate",
        "Helm",
        "HTML",
        "iOS SDK",
        "JUnit",
        "Java",
        "Java Servlet",
        "JPA",
        "JDBC",
        "JSP",
        "JSX",
        "Javascript",
        "JQuery",
        "Jenkins",
        "Jira",
        "Kafka",
        "Kafka Connect",
        "Kafka Converters",
        "Kafka Transforms",
        "Kafka SMT",
        "Kotlin",
        "KSQL",
        "Kubernetes",
        "LAMP",
        "MVC",
        "MVP",
        "MVVM",
        "Maven",
        "Microservices",
        "Mobile Application Development",
        "Mockito",
        "Objective-C",
        "Openshift Container Platform (OCP)",
        "PHP",
        "Progressive Web App (PWA)",
        "Python",
        "RabbitMQ",
        "React",
        "Rest APIs",
        "Redux",
        "Roboelectric",
        "SDLC",
        "SQL",
        "Schema Registry",
        "Scrum",
        "Spring",
        "Spring Boot",
        "Spring Cloud",
        "Spring MVC",
        "Strimzi Kafka",
        "Swift",
        "TDD",
        "Test Automation",
        "Tomcat",
        "Tornado",
        "VIPER",
        "Web Development",
        "XCTest",
        "XML",
        "XSLT",
        "Yii2"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Travel",
      "url": "",
      "keywords": []
    },
    {
      "name": "Books",
      "url": "",
      "keywords": []
    },
    {
      "name": "Photography",
      "url": "",
      "keywords": []
    }
  ],
  "references": []
}
