{
  "basics": {
    "name": "Mehdi Hasan",
    "label": "Data & Distributed Systems Engineer",
    "picture": "/profile.png",
    "phone": "",
    "skype": "skype.mehdi",
    "resume": "https://www.dropbox.com/s/w85g5044zldvncc/resume-mehdi-2020-01-21.pdf?dl=0",
    "website": "https://www.linkedin.com/in/md-mehdi-hasan/",
    "summary": "Experienced software systems engineer with 14+ years spanning networking, mobile, backend, and cloud — now specialized in distributed data systems and large-scale architectures. Proven track record in building real-time data platforms, streaming pipelines, and high-performance storage/analytics systems using Python, Java, and modern cloud ecosystems (GCP certified: Architect, Data Engineer, Developer). Hands-on expertise in IoT data ingestion & integration, distributed databases (ClickHouse, Postgres, Elastic), and event-driven systems (Kafka, Solace, RabbitMQ). Skilled in mentoring teams, onboarding newcomers, and raising the technical bar — while remaining deeply hands-on with system design and problem solving. Passionate about distributed systems, data-intensive applications, and continuous learning, with a long-term goal of designing the next generation of scalable, data-driven platforms.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Lund",
      "countryCode": "SE",
      "region": "Sweden"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "md-mehdi-hasan",
        "url": "https://www.linkedin.com/in/"
      },
      {
        "network": "Github",
        "username": "mehdihasan",
        "url": "https://github.com/"
      }
    ]
  },
  "work": [
    {
      "company": "Axis Communications AB",
      "position": "Experienced Software Engineer",
      "website": "https://www.axis.com/",
      "startDate": "01/02/2023",
      "endDate": "",
      "location": "Lund, Skane County, Sweden",
      "jobType": "Full-time",
      "summary": "Axis Communications AB is global industry leader in video surveillance and intelligent security solutions.",
      "highlights": [
        "Working in the Data Infrastructure & System Insights area, designing and developing data platforms to collect, process, store, and analyze device telemetry at scale.",
        "Successfully put the system into production, enabling scalable ingestion and monitoring of device telemetry data.",
        "Broke down data silos by creating ETL pipelines from legacy platforms into a modern distributed system, unlocking cross-team access to insights.",
        "Led the design, development, and rollout of migration strategy from legacy to modern data systems, improving reliability and future scalability.",
        "TECH: Data Engineering, Linux, Embedded Systems, Kafka, RabbitMQ, Clickhouse, Redis, GitOps, Microservices, Kubernetes, Python, Elasticsearch, Kibana, Prometheus.io, Grafana, Containerization, SQL, Git, REST API, Jenkins, Docker, API Development, DevOps"
      ]
    },
    {
      "company": "HCL Sweden AB",
      "position": "Senior Technical Lead",
      "website": "https://www.hcltech.com/geo-presence/sweden",
      "startDate": "03/31/2020",
      "endDate": "12/26/2022",
      "location": "Helsingborg, Skane County, Sweden",
      "jobType": "Full-time",
      "summary": "Worked with INGKA Group (IKEA IT AB) on designing and maintaining event-driven data platforms and high-throughput integrations across global retail systems.",
      "highlights": [
        "Designed and operated 3 enterprise Kafka clusters in Kubernetes (Strimzi) with high availability and resilience.",
        "Developed and optimized Kafka Connect plugins, SMTs, and streaming apps supporting global-scale data flows.",
        "Engineered event-driven pipelines integrating Kafka, GCP, Oracle, Solace Event Mesh, and microservices.",
        "Built microservices in Spring Boot, Kotlin, and Python Flask for business-critical integrations.",
        "Automated operational workflows with Ansible and CI/CD pipelines in Jenkins (Groovy, Bash).",
        "Introduced KSQL-based stream processing for real-time message transformations.",
        "TECH: Java, Kotlin, Python, Spring Boot, Strimzi Kafka, Kafka Connect, KSQL, Solace Event Mesh, Oracle, PostgreSQL, GCP (Pub/Sub, Cloud Run, GKE), Kubernetes, Helm, Docker, Ansible, Jenkins, Prometheus, Grafana, Splunk."
      ]
    },
    {
      "company": "Additude AB",
      "position": "Senior Information Technology Consultant",
      "website": "https://www.additude.se/",
      "startDate": "10/01/2019",
      "endDate": "03/30/2020",
      "location": "Malmo, Sweden",
      "jobType": "Full-time",
      "summary": "Work full time as senior information technology consultant.",
      "highlights": [
        "TECH: Android SDK, iOS SDK, Viper, MVP, MVVM, Android Jetpack Architecture, Fastlane, Jenkins, MsAppcenter, TDD, JUnit, Kubernetes, Docker, Espresso, React & Express, Accessibility, etc."
      ]
    },
    {
      "company": "RestaurangOnline Sverige AB",
      "position": "Mobile Application Developer",
      "website": "https://hungrig.se/",
      "startDate": "02/18/2019",
      "endDate": "09/30/2019",
      "location": "Lund, Sweden",
      "jobType": "Full-time",
      "summary": "Contributed to HUNGRIG.se, a food delivery platform for customers, restaurants, and couriers.",
      "highlights": [
        "Developed and distributed multiple native Android/iOS apps (Swift, Kotlin, Objective-C, Java).",
        "Automated build, test, and deploy workflows with Fastlane, Jenkins, and AppCenter.",
        "Implemented automation for iOS push certificate generation across 180+ apps.",
        "TECH: Swift, Kotlin, Objective-C, Android SDK, iOS SDK, Fastlane, Jenkins, Espresso, XCTest, Mockito."
      ]
    },
    {
      "company": "Cefalo AS",
      "position": "Senior Software Engineer",
      "website": "https://www.cefalo.com/",
      "startDate": "05/01/2016",
      "endDate": "01/15/2019",
      "location": "Dhaka, Bangladesh | Oslo, Norway",
      "jobType": "Full-time",
      "summary": "Worked for Dagens Næringsliv (DN), Norway's 3rd largest business newspaper, building mobile apps and backend systems.",
      "highlights": [
        "Led Android development of DN’s media app, growing users 6x between 2016–2018.",
        "Developed backend APIs (Spring Boot) powering mobile apps, improving scalability and performance.",
        "Contributed to iOS app modules in Swift and backend gateway apps in Java.",
        "TECH: Spring Boot, MySQL, Openshift, Java, Kotlin, Swift, Android SDK, iOS SDK, Jenkins, GDPR compliance."
      ]
    },
    {
      "company": "Syndao LLC",
      "position": "Software Engineering Consultant",
      "website": "https://syndaoapps.com/",
      "startDate": "12/01/2015",
      "endDate": "03/01/2019",
      "location": "Cincinnati, Ohio, USA (Remote)",
      "jobType": "Contract",
      "summary": "Consultant for US-based startup delivering web and mobile solutions across healthcare and emergency domains.",
      "highlights": [
        "Developed backend for emergency management system (CodeRed) using Spring Boot, OAuth2, JWT, and Firebase messaging.",
        "Built CI/CD pipelines (Jenkins) for automated deployment to Tomcat and cloud environments.",
        "Integrated SSO (Azure AD) for healthcare systems and automated data ingestion via CRON/SFTP.",
        "TECH: Java, Spring Boot, Hibernate, PHP Yii, MySQL, Firebase, AWS, Digital Ocean."
      ]
    },
    {
      "company": "iGlyphic",
      "position": "Software Consultant",
      "website": "http://iglyphic.com/",
      "startDate": "05/01/2015",
      "endDate": "05/01/2019",
      "location": "Dhaka, Bangladesh",
      "jobType": "Self-employed",
      "summary": "Founded and delivered software projects for SMEs, leading a team of freelancers across web and mobile.",
      "highlights": [
        "Delivered 20+ commercial products including mobile apps, WordPress themes, and APIs.",
        "Led design, development, and client delivery for 7+ successful projects across sectors."
      ]
    },
    {
      "company": "W3 Engineers",
      "position": "Sr. Software Engineer Team Lead",
      "website": "http://w3engineers.com/",
      "startDate": "12/01/2012",
      "endDate": "01/01/2016",
      "location": "Khulna, Bangladesh",
      "jobType": "Full-time",
      "summary": "Led backend and mobile development projects across multiple domains, from messaging apps to media platforms.",
      "highlights": [
        "Architected and built backend for YO! messaging app with Tornado (async Python), DynamoDB, and Twilio.",
        "Developed socket-based modules and authentication flows for Android/iOS apps.",
        "Led a cross-border team, managed releases, and conducted regular code reviews.",
        "TECH: Python (Tornado), DynamoDB, Java, Objective-C, PHP Yii, MySQL, Jenkins, JIRA."
      ]
    },
    {
      "company": "IIML",
      "position": "System Engineer",
      "website": "http://capturedata.com/",
      "startDate": "02/01/2011",
      "endDate": "02/01/2012",
      "location": "Dhaka, Bangladesh",
      "jobType": "Full-time",
      "summary": "IIMI helps organizations of all types and sizes transform their data into information and knowledge, driving insight and action. I was responsible to provide system / networking service to more than 3500+ data entry operators and software engineers",
      "highlights": []
    },
    {
      "company": "Aamra Networks",
      "position": "Network Engineer",
      "website": "https://www.aamranetworks.com/",
      "startDate": "09/01/2010",
      "endDate": "01/01/2011",
      "location": "Dhaka, Bangladesh",
      "jobType": "Full-time",
      "summary": "Aamra networks limited is one of the leader of communication solutions industry in Bangladesh.",
      "highlights": [
        "End user Gateway Server/Router/Switch/Polycom installation and troubleshooting.",
        "Provide solution to customers remotely."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "East West University",
      "area": "",
      "studyType": "B.Sc in Information and Communication Engineering",
      "startDate": "08/01/2006",
      "endDate": "2010",
      "gpa": "",
      "courses": []
    }
  ],
  "certification": [
    {
      "institution": "IBM",
      "area": "The badge earner demonstrates an understanding of Supervised vs. Unsupervised Learning, applications of different types of machine learning models, and how to build and evaluate machine learning models.",
      "studyType": "Machine Learning with Python",
      "issueDate": "03/24/2024",
      "certificate": "https://www.credly.com/badges/9325f370-0703-4887-83be-44f1ea473e14",
      "courses": []
    },
    {
      "institution": "IBM",
      "area": "This credential earner demonstrates knowledge of artificial intelligence (AI) concepts, such as natural language processing, computer vision, machine learning, deep learning, chatbots, and neural networks; AI ethics; and the applications of AI. The individual has a conceptual understanding of how to run an AI model using IBM Watson Studio. The earner is aware of the job outlook in fields that use AI and is familiar with the skills required for success in various roles in the domain.",
      "studyType": "Artificial Intelligence Fundamentals",
      "issueDate": "03/11/2024",
      "certificate": "https://www.credly.com/badges/5cd90da5-46ef-43a8-979b-08e22c0c2c82",
      "courses": []
    },
    {
      "institution": "IBM",
      "area": "This badge earner is able to code in Python for data science. They can analyze and visualize data with Python with packages like scikit-learn, matplotlib and bokeh.",
      "studyType": "Applied Data Science with Python",
      "issueDate": "11/24/2023",
      "certificate": "https://www.credly.com/badges/6647e21b-a8ca-42f0-9121-f6cedbd3b564",
      "courses": []
    },
    {
      "institution": "Solace",
      "area": "The badge earner has the foundational understanding of event-driven architecture (EDA), best practices associated with event-driven methodology, and how to apply them both to their applications and infrastructure as a whole. With the hands-on activities, the earner has the knowledge to get started with the Event Portal, to design and document event driven applications, events and event flows.",
      "studyType": "Solace Certified Event Driven Architecture Practitioner",
      "issueDate": "06/16/2023",
      "certificate": "https://www.credly.com/badges/6647e21b-a8ca-42f0-9121-f6cedbd3b564",
      "courses": []
    },
    {
      "institution": "Google Cloud",
      "area": "A Professional Data Engineer enables data-driven decision making by collecting, transforming, and publishing data. A data engineer should be able to design, build, operationalize, secure, and monitor data processing systems with a particular emphasis on security and compliance; scalability and efficiency; reliability and fidelity; and flexibility and portability. A Data Engineer should also be able to leverage, deploy, and continuously train pre-existing machine learning models.",
      "studyType": "Google Cloud Certified Professional Data Engineer",
      "issueDate": "01/11/2022",
      "certificate": "https://www.credly.com/badges/d07ecab1-7ad3-4c2a-8955-ba2af8c7a063",
      "courses": []
    },
    {
      "institution": "Google Cloud",
      "studyType": "Professional Cloud Developer",
      "area": "A Professional Cloud Developer builds scalable and highly available applications using Google-recommended tools and best practices. This individual has experience with cloud-native applications, developer tools, managed services, and next-generation databases. A Professional Cloud Developer also has proficiency with at least one general-purpose programming language and instruments their code to produce metrics, logs, and traces.",
      "issueDate": "12/22/2021",
      "certificate": "https://www.credly.com/badges/e2276edf-ed78-490d-b3fe-b07892c9156b",
      "courses": []
    },
    {
      "institution": "Google Cloud",
      "studyType": "Professional Cloud Architect",
      "area": "A Google Cloud Certified - Professional Cloud Architect enables organizations to leverage Google Cloud technologies. Through an understanding of cloud architecture and Google technology, this individual can design, develop, and manage robust, secure, scalable, highly available, and dynamic solutions to drive business objectives.",
      "issueDate": "01/12/2021",
      "certificate": "https://www.credly.com/badges/7fbf2de8-9de2-400b-94dd-a470328b1899",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Back End Development",
      "level": "Master",
      "keywords": [
        "Mentorship",
        "Technical Leadership",
        "Agile",
        "Scrum",
        "Cross-functional Collaboration",
        "Code Reviews",
        "Java",
        "Kotlin",
        "Python",
        "Spring Boot",
        "Spring Cloud",
        "Flask",
        "API Development",
        "Microservices",
        "System Design",
        "Kafka",
        "Kafka Connect",
        "Kafka Streams",
        "KSQL",
        "Solace Event Mesh",
        "RabbitMQ",
        "Event-Driven Architecture",
        "ClickHouse",
        "Postgres",
        "Elasticsearch",
        "Google Cloud (GCP)",
        "Kubernetes",
        "Openshift",
        "Docker",
        "Helm",
        "Ansible",
        "Terraform",
        "CI/CD",
        "Jenkins",
        "GitOps",
        "Prometheus",
        "Grafana"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "interests": [
    {
      "name": "Travel",
      "url": "",
      "keywords": []
    },
    {
      "name": "Books",
      "url": "",
      "keywords": []
    },
    {
      "name": "Photography",
      "url": "",
      "keywords": []
    }
  ],
  "references": []
}
